{
  "auth_terms_and_conditions": "Our services and the applications we provide are designed to meet or exceed current industry standards for organizational software. This includes adherence to best practices in:\n\n1.  Cloud-Native Architecture: Leveraging cloud platforms (AWS, Azure, GCP) for scalability, reliability, and global accessibility.\n2.  Data Security & Privacy: Implementing robust encryption, access controls, and compliance with regulations like GDPR and industry-specific standards.\n3.  User Experience (UX): Prioritizing intuitive interfaces and seamless workflows for enhanced productivity.\n4.  Integration Capabilities: Ensuring interoperability with existing enterprise systems through APIs and standardized protocols.\n5.  Scalability & Performance: Designing applications to handle growing data volumes and user loads efficiently.\n6.  AI & Automation: Incorporating artificial intelligence and machine learning for enhanced decision-making and automated processes where applicable.\n7.  Agile Development & Continuous Delivery: Employing modern development methodologies for rapid iteration and deployment of features.\n\nThese standards ensure that our organizational applications are competitive, secure, and future-proof.",
  "team_creation_terms_and_conditions": "By creating a basketball team within this platform, you agree to the following terms and conditions:\n\n1. Eligibility & Responsibility\n- The team creator must be at least 18 years old or have the consent of a legal guardian.\n- The team creator is responsible for managing the roster, submitting required information, and maintaining team conduct.\n\n2. League Participation\n- Created teams are eligible to join local, regional, or national leagues through this platform.\n- Participation in any league must adhere to the official rules and schedules as defined by the organizing committee.\n\n3. Team Conduct & Fair Play\n- All players and team representatives must exhibit good sportsmanship, respect referees and opponents, and uphold the values of fair competition.\n- Misconduct may result in penalties, disqualification, or suspension.\n\n4. Accurate Information\n- All submitted team details must be accurate and up to date.\n- Any form of falsified information may result in rejection of team registration or league entry.\n\n5. Platform Compliance\n- Teams must comply with the platform’s terms of use, privacy policy, and community guidelines.\n- Abuse of features or violation of these terms may result in suspension or removal from the platform.\n\nBy proceeding with team creation, you confirm that you have read, understood, and agreed to these terms and conditions."
}